Revit 2027 API
ParameterTypeId.OptionSetId Property
 "Design Option Set Id"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId OptionSetId { get; }
Public Shared ReadOnly Property OptionSetId As ForgeTypeId
	Get
public:
static property ForgeTypeId^ OptionSetId {
	ForgeTypeId^ get ();
}
static member OptionSetId : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace